{"keras_version": "2.1.0", "config": [{"config": {"bias_constraint": null, "name": "dense_97", "batch_input_shape": [null, 30000], "use_bias": true, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "relu", "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "units": 256}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "name": "dense_98", "use_bias": true, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "relu", "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "units": 256}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "name": "dense_99", "use_bias": true, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "softmax", "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "units": 6}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow"}