{"keras_version": "2.0.8", "config": [{"config": {"bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "batch_input_shape": [null, 120, 160, 1], "trainable": true, "bias_constraint": null, "kernel_size": [3, 3], "activation": "linear", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "strides": [1, 1], "padding": "same", "kernel_regularizer": null, "kernel_constraint": null, "name": "conv2d_5", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "dtype": "float32", "filters": 32}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "name": "activation_7", "trainable": true}, "class_name": "Activation"}, {"config": {"bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_size": [3, 3], "activation": "linear", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "strides": [1, 1], "padding": "valid", "kernel_regularizer": null, "kernel_constraint": null, "name": "conv2d_6", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "filters": 32}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "name": "activation_8", "trainable": true}, "class_name": "Activation"}, {"config": {"strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_3", "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_48", "trainable": true, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_size": [3, 3], "activation": "linear", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "strides": [1, 1], "padding": "same", "kernel_regularizer": null, "kernel_constraint": null, "name": "conv2d_7", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "filters": 64}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "name": "activation_9", "trainable": true}, "class_name": "Activation"}, {"config": {"bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_size": [3, 3], "activation": "linear", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "strides": [1, 1], "padding": "valid", "kernel_regularizer": null, "kernel_constraint": null, "name": "conv2d_8", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "filters": 64}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "name": "activation_10", "trainable": true}, "class_name": "Activation"}, {"config": {"strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_4", "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_49", "trainable": true, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"name": "flatten_2", "trainable": true}, "class_name": "Flatten"}, {"config": {"activation": "linear", "units": 100, "activity_regularizer": null, "trainable": true, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_67"}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_11", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dropout_50", "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"activation": "linear", "units": 1, "activity_regularizer": null, "trainable": true, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_68"}, "class_name": "Dense"}, {"config": {"activation": "sigmoid", "name": "activation_12", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential", "backend": "tensorflow"}