{"keras_version": "2.0.8", "config": [{"config": {"activation": "relu", "units": 256, "activity_regularizer": null, "batch_input_shape": [null, 19200], "trainable": true, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_37", "dtype": "float32"}, "class_name": "Dense"}, {"config": {"name": "dropout_23", "trainable": true, "rate": 0.75}, "class_name": "Dropout"}, {"config": {"activation": "relu", "units": 256, "activity_regularizer": null, "trainable": true, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_38"}, "class_name": "Dense"}, {"config": {"name": "dropout_24", "trainable": true, "rate": 0.75}, "class_name": "Dropout"}, {"config": {"activation": "relu", "units": 100, "activity_regularizer": null, "trainable": true, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_39"}, "class_name": "Dense"}, {"config": {"name": "dropout_25", "trainable": true, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"activation": "sigmoid", "units": 1, "activity_regularizer": null, "trainable": true, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_40"}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow"}