{"keras_version": "2.0.8", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"kernel_constraint": null, "batch_input_shape": [null, 76800], "name": "dense_14", "use_bias": true, "activity_regularizer": null, "units": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "bias_constraint": null, "activation": "relu", "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_constraint": null, "name": "dense_15", "use_bias": true, "activation": "relu", "units": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_constraint": null, "name": "dense_16", "use_bias": true, "activation": "sigmoid", "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null}}]}