{"keras_version": "2.0.8", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"name": "conv2d_5", "batch_input_shape": [null, 120, 160, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "activation": "linear", "bias_constraint": null, "dtype": "float32", "bias_regularizer": null, "filters": 32, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "trainable": true, "use_bias": true, "kernel_constraint": null, "padding": "same", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_7", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "config": {"name": "conv2d_6", "filters": 32, "kernel_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "trainable": true, "use_bias": true, "padding": "valid", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_8", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "data_format": "channels_last", "trainable": true, "strides": [2, 2], "padding": "valid", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_48", "trainable": true, "rate": 0.25}}, {"class_name": "Conv2D", "config": {"name": "conv2d_7", "filters": 64, "kernel_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "trainable": true, "use_bias": true, "padding": "same", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_9", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "config": {"name": "conv2d_8", "filters": 64, "kernel_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "trainable": true, "use_bias": true, "padding": "valid", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_10", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_4", "data_format": "channels_last", "trainable": true, "strides": [2, 2], "padding": "valid", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_49", "trainable": true, "rate": 0.25}}, {"class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_67", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "trainable": true, "units": 100, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_11", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_50", "trainable": true, "rate": 0.5}}, {"class_name": "Dense", "config": {"name": "dense_68", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "trainable": true, "units": 1, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_12", "activation": "sigmoid", "trainable": true}}]}